Revit 2027 API
ParameterTypeId.MassingIntegrationLevel Property
 "Constrain to Massing"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MassingIntegrationLevel { get; }
Public Shared ReadOnly Property MassingIntegrationLevel As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MassingIntegrationLevel {
	ForgeTypeId^ get ();
}
static member MassingIntegrationLevel : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace